In [1]:
import numpy as np
import pandas as pd

In [3]:
arquivo = "c:\\Users\\dan\\Documents\\Curso Data Science\\Datasets\\drinks.csv"
drinks = pd.read_csv(arquivo)
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'population', 'continent'],
      dtype='object')

verificando os tipos de dados do Dataset

In [4]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
population                       object
continent                        object
dtype: object

In [6]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population,continent
0,Afghanistan,0,0,0,0.0,34.660.000,Asia
1,Albania,89,132,54,4.9,2.876.000,Europe
2,Algeria,25,0,14,0.7,40.061.000,Africa
3,Andorra,245,138,312,12.4,77.281.000,Europe
4,Angola,217,57,45,5.9,28.081.000,Africa

In [7]:
# Modificando o tipo em uma série existente com ASTYPE()
drinks['beer_servings'] = drinks.beer_servings.astype(float)

In [8]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population,continent
0,Afghanistan,0.0,0,0,0.0,34.660.000,Asia
1,Albania,89.0,132,54,4.9,2.876.000,Europe
2,Algeria,25.0,0,14,0.7,40.061.000,Africa
3,Andorra,245.0,138,312,12.4,77.281.000,Europe
4,Angola,217.0,57,45,5.9,28.081.000,Africa

In [9]:
drinks.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
population                       object
continent                        object
dtype: object

In [10]:
drinks['wine_servings'] = drinks.wine_servings.astype(float)

In [11]:
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population,continent
0,Afghanistan,0.0,0,0.0,0.0,34.660.000,Asia
1,Albania,89.0,132,54.0,4.9,2.876.000,Europe
2,Algeria,25.0,0,14.0,0.7,40.061.000,Africa
3,Andorra,245.0,138,312.0,12.4,77.281.000,Europe
4,Angola,217.0,57,45.0,5.9,28.081.000,Africa
5,Antigua & Barbuda,102.0,128,45.0,4.9,86.295,North America
6,Argentina,193.0,25,221.0,8.3,43.085.000,South America
7,Armenia,21.0,179,11.0,3.8,2.925.000,Europe
8,Australia,261.0,72,212.0,10.4,24.013.000,Oceania
9,Austria,279.0,75,191.0,9.7,8.725.111,Europe

In [12]:
#modificando o tipo enquanto le
drinks = pd.read_csv(arquivo, dtype={'spirit_servings':float})
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                 float64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
population                       object
continent                        object
dtype: object

# Lendo outro Dataset

In [14]:
arquivo = "c:\\Users\\dan\\Documents\\Curso Data Science\\Datasets\\sanduiches.txt"
vendas = pd.read_table(arquivo)
vendas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [15]:

vendas.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [17]:
vendas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [20]:
a = vendas.item_price.str.replace('$','')

In [21]:
vendas['item_price'] = pd.Series(a)

In [22]:
vendas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [23]:
vendas['item_price'] = vendas.item_price.astype(float)

In [24]:
vendas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [25]:
média = vendas.item_price.mean()

In [26]:
média

7.464335785374397

# mais um pouco sobre booleanos

In [27]:
vendas.item_name.str.contains('Chicken').head(10)

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8    False
9    False
Name: item_name, dtype: bool

In [28]:
vendas.item_name.str.contains('Chicken').astype(int).head(20)

0     0
1     0
2     0
3     0
4     1
5     1
6     0
7     0
8     0
9     0
10    0
11    1
12    1
13    1
14    0
15    0
16    1
17    1
18    0
19    1
Name: item_name, dtype: int32

In [31]:
#podemos fazer o procedimento com uma variável

vendas_int = vendas.item_name.str.contains('Chicken').astype(int)
vendas_int.head(20)

0     0
1     0
2     0
3     0
4     1
5     1
6     0
7     0
8     0
9     0
10    0
11    1
12    1
13    1
14    0
15    0
16    1
17    1
18    0
19    1
Name: item_name, dtype: int32

In [32]:
vendas.item_name.str.contains('Tomato').astype(int).sum()

111

In [33]:
vendas.item_name.str.contains('Coke').astype(int).sum()

0

In [ ]:
vendas.choice_descr